#### Terraform fmt for dev `success`
#### Terraform init for dev `success`
#### Terraform validate for dev `success`
#### Terraform plan for dev `success`

<details><summary>Show plan result for dev </summary>

```

provision
random_password.vm_password: Refreshing state... [id=none]
proxmox_virtual_environment_download_file.latest_ubuntu_22_jammy_qcow2_img: Refreshing state... [id=local:iso/jammy-server-cloudimg-amd64.img]
proxmox_virtual_environment_vm.dev_vm: Refreshing state... [id=100]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # proxmox_virtual_environment_download_file.debian_12_cloud_image will be created
  + resource "proxmox_virtual_environment_download_file" "debian_12_cloud_image" {
      + content_type   = "iso"
      + datastore_id   = "local"
      + file_name      = "debian_12_cloud_image.img"
      + id             = (known after apply)
      + node_name      = "pve"
      + overwrite      = true
      + size           = (known after apply)
      + upload_timeout = 600
      + url            = "https://cloud.debian.org/images/cloud/bookworm/latest/debian-12-generic-amd64.qcow2"
      + verify         = true
    }

  # proxmox_virtual_environment_vm.dev_vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "dev_vm" {
        id                      = "100"
        name                    = "dev"
        # (25 unchanged attributes hidden)

      ~ disk {
          ~ ssd               = false -> true
            # (8 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.test_vm will be created
  + resource "proxmox_virtual_environment_vm" "test_vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "test-vm"
      + network_interface_names = (known after apply)
      + node_name               = "pve"
      + on_boot                 = true
      + reboot                  = false
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = true
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)

      + disk {
          + cache             = "none"
          + datastore_id      = "local-zfs"
          + discard           = "ignore"
          + file_format       = (known after apply)
          + file_id           = (known after apply)
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + size              = 100
          + ssd               = false
        }

      + initialization {
          + datastore_id = "local-lvm"

          + user_account {
              + keys     = [
                  + "ecdsa-sha2-nistp521 AAAAE2VjZHNhLXNoYTItbmlzdHA1MjEAAAAIbmlzdHA1MjEAAACFBAEC7fki9UNyuFGcNNeAOGCbUXxf/w+JGkKp7BR68gMTNmMYBE4/x+naDqJgajJElPuAYJaI715XBgKAOg+gwce2vwB9+XzRPCClEo6zZB56HugAVpnkje9PpdYJS6tattzD/56ofFDQltXVdYAuE49eOBNoyiD9I9y20inXkVJuEg5PCw==",
                ]
              + password = (sensitive value)
              + username = "devops"
            }
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Warning: The file does not exist in datastore and resource must be recreated.

file does not exists in datastore

Warning: Argument is deprecated

  with proxmox_virtual_environment_vm.dev_vm,
  on debian.tf line 106, in resource "proxmox_virtual_environment_vm" "dev_vm":
 106:       server = "192.168.${var.tag}.1"

The `server` attribute is deprecated and will be removed in a future release.
Please use the `servers` attribute instead.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @vpletea, Action: `pull_request`*